#include "Generic.h"

namespace interpreter {

	////////////////////////////////////////////////////////////////////////////////
	// Базовые комманды
	////////////////////////////////////////////////////////////////////////////////

	//------------------------------------------------------------------------------
	// NOP - Сразу переводит eip на следующую инструкцию
	void nop (CVMState& vmState)
	{
		// Execute nothing
		{
		}
	}

	//------------------------------------------------------------------------------
	// Брейкпоинт, приостанавливает выполнение команды
	// BRK
	void brk (CVMState& vmState)
	{
		// Execute
		{
			// TODO
		}
	}

	//------------------------------------------------------------------------------
	// Корректно завершить работу интерпретатора
	void halt (CVMState& vmState)
	{
		vmState.m_bStillWorking = 0;
	}

	//------------------------------------------------------------------------------
}