#include "jmp.h"

namespace interpreter {

	////////////////////////////////////////////////////////////////////////////////
	// JMP <смещение>
	// Формирование команды: jmp<размер_операндов><тип_источника>
	// <размер_операндов>: 
	//	32
	// <тип_источника>:
	//	m - операнд в памяти
	//	v - непосредственное значение
	////////////////////////////////////////////////////////////////////////////////

	//------------------------------------------------------------------------------
	void jmp32m (CVMState& vmState)
	{
		dword* memSrc = vmState.Read_32m();
		vmState.JumpTo( *memSrc );
	}

	//------------------------------------------------------------------------------
	void jmp32v (CVMState& vmState)
	{
		const dword valSrc = vmState.Read_32v();
		vmState.JumpTo( valSrc );
	}

	//------------------------------------------------------------------------------
}